###################################################################

# Created by write_sdc on Wed Jan 15 18:44:12 2014

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports out_valid]
set_load -pin_load 1 [get_ports {x_out[31]}]
set_load -pin_load 1 [get_ports {x_out[30]}]
set_load -pin_load 1 [get_ports {x_out[29]}]
set_load -pin_load 1 [get_ports {x_out[28]}]
set_load -pin_load 1 [get_ports {x_out[27]}]
set_load -pin_load 1 [get_ports {x_out[26]}]
set_load -pin_load 1 [get_ports {x_out[25]}]
set_load -pin_load 1 [get_ports {x_out[24]}]
set_load -pin_load 1 [get_ports {x_out[23]}]
set_load -pin_load 1 [get_ports {x_out[22]}]
set_load -pin_load 1 [get_ports {x_out[21]}]
set_load -pin_load 1 [get_ports {x_out[20]}]
set_load -pin_load 1 [get_ports {x_out[19]}]
set_load -pin_load 1 [get_ports {x_out[18]}]
set_load -pin_load 1 [get_ports {x_out[17]}]
set_load -pin_load 1 [get_ports {x_out[16]}]
set_load -pin_load 1 [get_ports {x_out[15]}]
set_load -pin_load 1 [get_ports {x_out[14]}]
set_load -pin_load 1 [get_ports {x_out[13]}]
set_load -pin_load 1 [get_ports {x_out[12]}]
set_load -pin_load 1 [get_ports {x_out[11]}]
set_load -pin_load 1 [get_ports {x_out[10]}]
set_load -pin_load 1 [get_ports {x_out[9]}]
set_load -pin_load 1 [get_ports {x_out[8]}]
set_load -pin_load 1 [get_ports {x_out[7]}]
set_load -pin_load 1 [get_ports {x_out[6]}]
set_load -pin_load 1 [get_ports {x_out[5]}]
set_load -pin_load 1 [get_ports {x_out[4]}]
set_load -pin_load 1 [get_ports {x_out[3]}]
set_load -pin_load 1 [get_ports {x_out[2]}]
set_load -pin_load 1 [get_ports {x_out[1]}]
set_load -pin_load 1 [get_ports {x_out[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports reset]
set_max_fanout 20 [get_ports in_en]
set_max_fanout 20 [get_ports {b_in[15]}]
set_max_fanout 20 [get_ports {b_in[14]}]
set_max_fanout 20 [get_ports {b_in[13]}]
set_max_fanout 20 [get_ports {b_in[12]}]
set_max_fanout 20 [get_ports {b_in[11]}]
set_max_fanout 20 [get_ports {b_in[10]}]
set_max_fanout 20 [get_ports {b_in[9]}]
set_max_fanout 20 [get_ports {b_in[8]}]
set_max_fanout 20 [get_ports {b_in[7]}]
set_max_fanout 20 [get_ports {b_in[6]}]
set_max_fanout 20 [get_ports {b_in[5]}]
set_max_fanout 20 [get_ports {b_in[4]}]
set_max_fanout 20 [get_ports {b_in[3]}]
set_max_fanout 20 [get_ports {b_in[2]}]
set_max_fanout 20 [get_ports {b_in[1]}]
set_max_fanout 20 [get_ports {b_in[0]}]
create_clock [get_ports clk]  -period 126  -waveform {0 63}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  1  [get_ports reset]
set_input_delay -clock clk  1  [get_ports in_en]
set_input_delay -clock clk  1  [get_ports {b_in[15]}]
set_input_delay -clock clk  1  [get_ports {b_in[14]}]
set_input_delay -clock clk  1  [get_ports {b_in[13]}]
set_input_delay -clock clk  1  [get_ports {b_in[12]}]
set_input_delay -clock clk  1  [get_ports {b_in[11]}]
set_input_delay -clock clk  1  [get_ports {b_in[10]}]
set_input_delay -clock clk  1  [get_ports {b_in[9]}]
set_input_delay -clock clk  1  [get_ports {b_in[8]}]
set_input_delay -clock clk  1  [get_ports {b_in[7]}]
set_input_delay -clock clk  1  [get_ports {b_in[6]}]
set_input_delay -clock clk  1  [get_ports {b_in[5]}]
set_input_delay -clock clk  1  [get_ports {b_in[4]}]
set_input_delay -clock clk  1  [get_ports {b_in[3]}]
set_input_delay -clock clk  1  [get_ports {b_in[2]}]
set_input_delay -clock clk  1  [get_ports {b_in[1]}]
set_input_delay -clock clk  1  [get_ports {b_in[0]}]
set_output_delay -clock clk  0.5  [get_ports out_valid]
set_output_delay -clock clk  0.5  [get_ports {x_out[31]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[30]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[29]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[28]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[27]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[26]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[25]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[24]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[23]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[22]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[21]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[20]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[19]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[18]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[17]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[16]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[15]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[14]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[13]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[12]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[11]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[10]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[9]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[8]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[7]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[6]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[5]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[4]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[3]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[2]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[1]}]
set_output_delay -clock clk  0.5  [get_ports {x_out[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports in_en]
set_drive 1  [get_ports {b_in[15]}]
set_drive 1  [get_ports {b_in[14]}]
set_drive 1  [get_ports {b_in[13]}]
set_drive 1  [get_ports {b_in[12]}]
set_drive 1  [get_ports {b_in[11]}]
set_drive 1  [get_ports {b_in[10]}]
set_drive 1  [get_ports {b_in[9]}]
set_drive 1  [get_ports {b_in[8]}]
set_drive 1  [get_ports {b_in[7]}]
set_drive 1  [get_ports {b_in[6]}]
set_drive 1  [get_ports {b_in[5]}]
set_drive 1  [get_ports {b_in[4]}]
set_drive 1  [get_ports {b_in[3]}]
set_drive 1  [get_ports {b_in[2]}]
set_drive 1  [get_ports {b_in[1]}]
set_drive 1  [get_ports {b_in[0]}]
